import math
'''
모듈(module) 10강-1차시
▪모듈
 서로 관련있는 프로그램의 구성요소들을 모아놓은 것으로 정의
 모듈에는 함수, 클래스, 데이터들이 포함될 수 있다
▪파이썬 모듈
 사용자가 직접 생성하여 사용하는 사용자 생성 모듈
 파이썬 패키지 안에 포함된 표준 모듈
 회사 등에서 특정 기능을 제공하는 서드파티Third Party 모듈
 
 
모듈(module)
 서로 관련있는 프로그램의 구성요소들을 모아놓은 것으로 정의
 모듈에는 함수, 클래스, 데이터들이 포함될 수 있다
▪ 파이썬 함수나 변수 또는 클래스들을 모아놓은 스크립트 파일
▪ 파이썬은 수많은 개발자들에 의해서 개발된 많은 모듈이 있음
▪ 만들어진 모듈을 가져올 때에는 ‘import’와 함께 모듈 이름을
써 줌
▪ 사용할 때에는 모듈 이름에 점(.)을 찍은 후 모듈 안의
구성요소를 작성

모듈 (module)
 코드를 분리하고 공유하는 기능
 
 표준 모듈
• 파이썬에 기본적으로 내장된 모듈
 외부 모듈
• 사람들이 만들어 공개한 모듈
'''
